In [1]:
import pandas as pd
import matplotlib.pyplot as plt

df_train = pd.read_csv('C:/Users/dilip/Desktop/Other/titanic/train.csv')
df_test = pd.read_csv('C:/Users/dilip/Desktop/Other/titanic/test.csv')
df_train.shape

(891, 12)

In [2]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
# data analysis and wrangling
import pandas as pd
import numpy as np
import random as rnd

# visualization
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

# machine learning
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC, LinearSVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.linear_model import Perceptron
from sklearn.linear_model import SGDClassifier
from sklearn.tree import DecisionTreeClassifier

In [4]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
df_train.info()
print('-'*40)
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
----------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [6]:
df_train.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [7]:
le = LabelEncoder()
df_train.loc[:,'Sex'] = le.fit_transform(df_train.loc[:,'Sex'])
df_test.loc[:,'Sex'] = le.fit_transform(df_test.loc[:,'Sex'])

In [8]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,S

In [10]:
df_train = df_train.drop(['Cabin', 'Ticket', 'PassengerId'], axis=1)
df_test = df_test.drop(['Cabin', 'Ticket'], axis=1)

In [11]:
combine = [df_train, df_test]
combine[0].shape, combine[1].shape

((891, 9), (418, 9))

In [12]:
for dataset in combine:
    dataset['Title'] = dataset.Name.str.extract(' ([A-Za-z]+)\.', expand=False)

In [13]:
pd.crosstab(df_train['Title'], df_train['Sex'])

Sex         0    1
Title
Capt        0    1
Col         0    2
Countess    1    0
Don         0    1
Dr          1    6
Jonkheer    0    1
Lady        1    0
Major       0    2
Master      0   40
Miss      182    0
Mlle        2    0
Mme         1    0
Mr          0  517
Mrs       125    0
Ms          1    0
Rev         0    6
Sir         0    1

In [14]:
for dataset in combine:
    dataset['Title'] = dataset['Title'].replace(['Lady', 'Countess','Capt', 'Col','Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')

    dataset['Title'] = dataset['Title'].replace('Mlle', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Ms', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Mme', 'Mrs')

In [15]:
df_train[['Title', 'Survived']].groupby(['Title'], as_index = False).mean()

    Title  Survived
0  Master  0.575000
1    Miss  0.702703
2      Mr  0.156673
3     Mrs  0.793651
4    Rare  0.347826

In [16]:
for dataset in combine:
    dataset['Title'] = le.fit_transform(dataset['Title'])

In [17]:
for dataset in combine:
    dataset['FamilySize'] = dataset['SibSp'] + dataset['Parch'] + 1
    
df_train[['FamilySize', 'Survived']].groupby(['FamilySize'], as_index = False).mean().sort_values(by = 'Survived', ascending = False)

   FamilySize  Survived
3           4  0.724138
2           3  0.578431
1           2  0.552795
6           7  0.333333
0           1  0.303538
4           5  0.200000
5           6  0.136364
7           8  0.000000
8          11  0.000000

In [18]:
for dataset in combine:
    dataset['IsAlone'] = 0
    dataset.loc[dataset['FamilySize'] == 1, 'IsAlone'] = 1
    
df_train[['IsAlone', 'Survived']].groupby(['IsAlone'], as_index = False).mean().sort_values(by = 'Survived', ascending = False)

   IsAlone  Survived
0        0  0.505650
1        1  0.303538

In [19]:
df_train = df_train.drop(['Name', 'SibSp', 'Parch', 'FamilySize'], axis=1)
df_test = df_test.drop(['Name', 'SibSp', 'Parch', 'FamilySize'], axis=1)

In [20]:
df_train.shape, df_test.shape

((891, 8), (418, 8))

In [21]:
freq = df_train.Embarked.dropna().mode()[0]
freq

'S'

In [22]:
df_train['Embarked'] = df_train['Embarked'].fillna(freq)

In [23]:
df_train[['Embarked', 'Survived']].groupby(['Embarked']).mean()

          Survived
Embarked
C         0.553571
Q         0.389610
S         0.339009

In [24]:
df_train.Embarked.describe(include = [0])

count     891
unique      3
top         S
freq      646
Name: Embarked, dtype: object

In [25]:
for dataset in combine:
    dataset['Embarked'].dropna()

In [26]:
df_test['Embarked'] = df_test['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)

df_test.head()

   PassengerId  Pclass  Sex   Age     Fare  Embarked  Title  IsAlone
0          892       3    1  34.5   7.8292         2      2        1
1          893       3    0  47.0   7.0000         0      3        0
2          894       2    1  62.0   9.6875         2      2        1
3          895       3    1  27.0   8.6625         0      2        1
4          896       3    0  22.0  12.2875         0      3        0

In [27]:
df_train['Embarked'] = df_train['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)
df_train.head()

   Survived  Pclass  Sex   Age     Fare  Embarked  Title  IsAlone
0         0       3    1  22.0   7.2500         0      2        0
1         1       1    0  38.0  71.2833         1      3        0
2         1       3    0  26.0   7.9250         0      1        1
3         1       1    0  35.0  53.1000         0      3        0
4         0       3    1  35.0   8.0500         0      2        1

In [28]:
df_test['Fare'] = df_test.Fare.fillna(df_test.Fare.dropna().median())

In [29]:
df_train['FareBand'] = pd.qcut(df_test.Fare, 4)
df_train[['FareBand', 'Survived']].groupby(['FareBand'], as_index = False).mean()

            FareBand  Survived
0    (-0.001, 7.896]  0.456140
1    (7.896, 14.454]  0.402062
2   (14.454, 31.472]  0.343137
3  (31.472, 512.329]  0.352381

In [30]:
df_train.loc[df_train['Fare'] <= 7.9, 'Fare'] = 0
df_train.loc[(df_train['Fare'] > 7.9) & (df_train['Fare'] <= 14.4) , 'Fare'] = 1
df_train.loc[(df_train['Fare'] > 14.4) & (df_train['Fare'] <= 31.5), 'Fare'] = 2
df_train.loc[df_train['Fare'] > 31.5, 'Fare'] = 3
df_train['Fare'] = df_train['Fare'].astype(int)

df_test.loc[df_test['Fare'] <= 7.9, 'Fare'] = 0
df_test.loc[(df_test['Fare'] > 7.9) & (df_test['Fare'] <= 14.4) , 'Fare'] = 1
df_test.loc[(df_test['Fare'] > 14.4) & (df_test['Fare'] <= 31.5), 'Fare'] = 2
df_test.loc[df_test['Fare'] > 31.5, 'Fare'] = 3
df_test['Fare'] = df_test['Fare'].astype(int)
df_train.head()

,Survived,Pclass,Sex,Age,Fare,Embarked,Title,IsAlone,FareBand
0,0,3,1,22.0,0,0,2,0,"(-0.001, 7.896]"
1,1,1,0,38.0,3,1,3,0,"(-0.001, 7.896]"
2,1,3,0,26.0,1,0,1,1,"(7.896, 14.454]"
3,1,1,0,35.0,3,0,3,0,"(7.896, 14.454]"
4,0,3,1,35.0,1,0,2,1,"(7.896, 14.454]"

In [31]:
df_train['AgeBand'] = pd.cut(df_test.Age, 5)
df_train[['AgeBand', 'Survived']].groupby(['AgeBand'], as_index = False).mean()

            AgeBand  Survived
0  (0.0942, 15.336]  0.281250
1  (15.336, 30.502]  0.434524
2  (30.502, 45.668]  0.325000
3  (45.668, 60.834]  0.357143
4    (60.834, 76.0]  0.500000

In [32]:
df_train.loc[df_train['Age'] <= 15.3, 'Age'] = 0
df_train.loc[(df_train['Age'] > 15.3) & (df_train['Age'] <= 30.5) , 'Age'] = 1
df_train.loc[(df_train['Age'] > 30.5) & (df_train['Age'] <= 45.7), 'Age'] = 2
df_train.loc[(df_train['Age'] > 45.7) & (df_train['Age'] <= 60.8), 'Age'] = 3
df_train.loc[df_train['Age'] > 60.8, 'Age'] = 4

df_test.loc[df_test['Age'] <= 15.3, 'Age'] = 0
df_test.loc[(df_test['Age'] > 15.3) & (df_test['Age'] <= 30.5) , 'Age'] = 1
df_test.loc[(df_test['Age'] > 30.5) & (df_test['Age'] <= 45.7), 'Age'] = 2
df_test.loc[(df_test['Age'] > 45.7) & (df_test['Age'] <= 60.8), 'Age'] = 3
df_test.loc[df_test['Age'] > 60.8, 'Age'] = 4

In [33]:
df_test.head()

   PassengerId  Pclass  Sex  Age  Fare  Embarked  Title  IsAlone
0          892       3    1  2.0     0         2      2        1
1          893       3    0  3.0     0         0      3        0
2          894       2    1  4.0     1         2      2        1
3          895       3    1  1.0     1         0      2        1
4          896       3    0  1.0     1         0      3        0

In [34]:
df_train = df_train.drop(['FareBand'], axis=1)
df_train.head()

,Survived,Pclass,Sex,Age,Fare,Embarked,Title,IsAlone,AgeBand
0,0,3,1,1.0,0,0,2,0,"(30.502, 45.668]"
1,1,1,0,2.0,3,1,3,0,"(45.668, 60.834]"
2,1,3,0,1.0,1,0,1,1,"(60.834, 76.0]"
3,1,1,0,2.0,3,0,3,0,"(15.336, 30.502]"
4,0,3,1,2.0,1,0,2,1,"(15.336, 30.502]"

In [35]:
Y_train = df_train['Survived']
Y_train.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [36]:
X_train = df_train.drop(['Survived'], axis=1)
X_train.head()

   Pclass  Sex  Age  Fare  Embarked  Title  IsAlone           AgeBand
0       3    1  1.0     0         0      2        0  (30.502, 45.668]
1       1    0  2.0     3         1      3        0  (45.668, 60.834]
2       3    0  1.0     1         0      1        1    (60.834, 76.0]
3       1    0  2.0     3         0      3        0  (15.336, 30.502]
4       3    1  2.0     1         0      2        1  (15.336, 30.502]

In [37]:
X_test = df_test.drop(['PassengerId'], axis=1)

In [38]:
guess_ages = np.zeros((2,3))
guess_ages

array([[0., 0., 0.],
       [0., 0., 0.]])

In [39]:
for i in range(0, 2):
    for j in range(0, 3):
        guess_df = X_train[(X_train['Sex'] == i) & (X_train['Pclass'] == j+1)]['Age'].dropna()

        # age_mean = guess_df.mean()
        # age_std = guess_df.std()
        # age_guess = rnd.uniform(age_mean - age_std, age_mean + age_std)

        age_guess = guess_df.median()

        # Convert random age float to nearest .5 age
        guess_ages[i,j] = int( age_guess/0.5 + 0.5 ) * 0.5

for i in range(0, 2):
    for j in range(0, 3):
        X_train.loc[ (X_train.Age.isnull()) & (X_train.Sex == i) & (X_train.Pclass == j+1),'Age'] = guess_ages[i,j]

X_train['Age'] = X_train['Age'].astype(int)

X_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
Pclass      891 non-null int64
Sex         891 non-null int64
Age         891 non-null int32
Fare        891 non-null int32
Embarked    891 non-null int32
Title       891 non-null int64
IsAlone     891 non-null int64
AgeBand     332 non-null category
dtypes: category(1), int32(3), int64(4)
memory usage: 39.3 KB

In [40]:
for i in range(0, 2):
    for j in range(0, 3):
        guess_df = X_test[(X_test['Sex'] == i) & (X_test['Pclass'] == j+1)]['Age'].dropna()

        # age_mean = guess_df.mean()
        # age_std = guess_df.std()
        # age_guess = rnd.uniform(age_mean - age_std, age_mean + age_std)

        age_guess = guess_df.median()

        # Convert random age float to nearest .5 age
        guess_ages[i,j] = int( age_guess/0.5 + 0.5 ) * 0.5

for i in range(0, 2):
    for j in range(0, 3):
        X_test.loc[ (X_test.Age.isnull()) & (X_test.Sex == i) & (X_test.Pclass == j+1),'Age'] = guess_ages[i,j]

X_test['Age'] = X_test['Age'].astype(int)

X_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
Pclass      418 non-null int64
Sex         418 non-null int64
Age         418 non-null int32
Fare        418 non-null int32
Embarked    418 non-null int32
Title       418 non-null int64
IsAlone     418 non-null int64
dtypes: int32(3), int64(4)
memory usage: 18.0 KB

In [41]:
X_train = X_train.drop(['AgeBand'], axis=1)
X_train.head()

   Pclass  Sex  Age  Fare  Embarked  Title  IsAlone
0       3    1    1     0         0      2        0
1       1    0    2     3         1      3        0
2       3    0    1     1         0      1        1
3       1    0    2     3         0      3        0
4       3    1    2     1         0      2        1

In [42]:
X_train.shape

(891, 7)

In [43]:
one = OneHotEncoder(categorical_features = [0,2,3,4,5])
X_train = one.fit_transform(X_train).toarray()

In [44]:
X_train = X_train[:,[1,2,3,5,6,7,8,10,11,12,14,15,17,18,19,20,21]]

In [45]:
one = OneHotEncoder(categorical_features = [0,2,3,4,5])
X_test = one.fit_transform(X_test).toarray()

In [46]:
X_test = X_test[:,[1,2,3,5,6,7,8,10,11,12,14,15,17,18,19,20,21]]

In [47]:
logreg = LogisticRegression()
logreg.fit(X_train, Y_train)
Y_pred = logreg.predict(X_test)

In [48]:
x = round(logreg.score(X_train, Y_train), 2)
x

0.82

In [49]:
pd.DataFrame(Y_pred)

     0
0    0
1    0
2    0
3    0
4    1
5    0
6    1
7    0
8    1
9    0
10   0
11   0
12   1
13   0
14   1
15   1
16   0
17   0
18   0
19   1
20   0
21   0
22   1
23   0
24   1
25   0
26   1
27   0
28   0
29   0
..  ..
388  0
389  0
390  0
391  1
392  0
393  0
394  0
395  1
396  0
397  1
398  0
399  0
400  1
401  0
402  1
403  0
404  0
405  0
406  0
407  0
408  1
409  1
410  1
411  1
412  1
413  0
414  1
415  0
416  0
417  0

[418 rows x 1 columns]

In [51]:
submission = pd.DataFrame({"PassengerId": df_test["PassengerId"],"Survived": Y_pred})

In [52]:
submission.to_csv('C:/Users/dilip/Desktop/Other/titanic/submission.csv', index=False)